TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_dcsm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_EXEONLYSECT1R register
//
//*************************************************************************************************
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B0_SECT0        0x1U          // Execute-Only Flash Bank0
                                                                    // Sector 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B0_SECT1        0x2U          // Execute-Only Flash Bank0
                                                                    // Sector 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B0_SECT2        0x4U          // Execute-Only Flash Bank0
                                                                    // Sector 2
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B0_SECT3        0x8U          // Execute-Only Flash Bank0
                                                                    // Sector 3
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B0_SECT31_4     0x10U         // Execute-Only Flash Bank0
                                                                    // Sector 31-4
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B0_SECT63_32    0x20U         // Execute-Only Flash Bank0
                                                                    // Sector 63-32
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B0_SECT95_64    0x40U         // Execute-Only Flash Bank0
                                                                    // Sector 95-64
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B0_SECT127_96   0x80U         // Execute-Only Flash Bank0
                                                                    // Sector 127-96
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B1_SECT0        0x100U        // Execute-Only Flash Bank1
                                                                    // Sector 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B1_SECT1        0x200U        // Execute-Only Flash Bank1
                                                                    // Sector 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B1_SECT2        0x400U        // Execute-Only Flash Bank1
                                                                    // Sector 2
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B1_SECT3        0x800U        // Execute-Only Flash Bank1
                                                                    // Sector 3
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B1_SECT31_4     0x1000U       // Execute-Only Flash Bank1
                                                                    // Sector 31-4
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B1_SECT63_32    0x2000U       // Execute-Only Flash Bank1
                                                                    // Sector 63-32
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B1_SECT95_64    0x4000U       // Execute-Only Flash Bank1
                                                                    // Sector 95-64
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B1_SECT127_96   0x8000U       // Execute-Only Flash Bank1
                                                                    // Sector 127-96
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B2_SECT0        0x10000U      // Execute-Only Flash Bank2
                                                                    // Sector 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B2_SECT1        0x20000U      // Execute-Only Flash Bank2
                                                                    // Sector 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B2_SECT2        0x40000U      // Execute-Only Flash Bank2
                                                                    // Sector 2
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B2_SECT3        0x80000U      // Execute-Only Flash Bank2
                                                                    // Sector 3
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B2_SECT31_4     0x100000U     // Execute-Only Flash Bank2
                                                                    // Sector 31-4
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B2_SECT63_32    0x200000U     // Execute-Only Flash Bank2
                                                                    // Sector 63-32
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B2_SECT95_64    0x400000U     // Execute-Only Flash Bank2
                                                                    // Sector 95-64
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B2_SECT127_96   0x800000U     // Execute-Only Flash Bank2
                                                                    // Sector 127-96
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B3_SECT0        0x1000000U    // Execute-Only Flash Bank3
                                                                    // Sector 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B3_SECT1        0x2000000U    // Execute-Only Flash Bank3
                                                                    // Sector 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B3_SECT2        0x4000000U    // Execute-Only Flash Bank3
                                                                    // Sector 2
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B3_SECT3        0x8000000U    // Execute-Only Flash Bank3
                                                                    // Sector 3
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B3_SECT31_4     0x10000000U   // Execute-Only Flash Bank3
                                                                    // Sector 31-4
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B3_SECT63_32    0x20000000U   // Execute-Only Flash Bank3
                                                                    // Sector 63-32
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B3_SECT95_64    0x40000000U   // Execute-Only Flash Bank3
                                                                    // Sector 95-64
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_B3_SECT127_96   0x80000000U   // Execute-Only Flash Bank3
                                                                    // Sector 127-96

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_EXEONLYSECT2R register
//
//*************************************************************************************************
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_B4_SECT0        0x1U    // Execute-Only Flash Bank4 Sector 0
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_B4_SECT1        0x2U    // Execute-Only Flash Bank4 Sector 1
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_B4_SECT2        0x4U    // Execute-Only Flash Bank4 Sector 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_B4_SECT3        0x8U    // Execute-Only Flash Bank4 Sector 3
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_B4_SECT31_4     0x10U   // Execute-Only Flash Bank4 Sector
                                                              // 31-4
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_B4_SECT63_32    0x20U   // Execute-Only Flash Bank4 Sector
                                                              // 63-32
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_B4_SECT95_64    0x40U   // Execute-Only Flash Bank4 Sector
                                                              // 95-64
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_B4_SECT127_96   0x80U   // Execute-Only Flash Bank4 Sector
                                                              // 127-96

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_EXEONLYRAM1R register
//
//*************************************************************************************************
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM0    0x1U      // Execute-Only RAM CPU1.LS0
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM1    0x2U      // Execute-Only RAM CPU1.LS1
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM2    0x4U      // Execute-Only RAM CPU1.LS2
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM3    0x8U      // Execute-Only RAM CPU1.LS3
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM4    0x10U     // Execute-Only RAM CPU1.LS4
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM5    0x20U     // Execute-Only RAM CPU1.LS5
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM6    0x40U     // Execute-Only RAM CPU1.LS6
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM7    0x80U     // Execute-Only RAM CPU1.LS7
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM8    0x100U    // Execute-Only RAM CPU1.LS8
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM9    0x200U    // Execute-Only RAM CPU1.LS9
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM10   0x400U    // Execute-Only RAM D0
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM11   0x800U    // Execute-Only RAM D1
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM12   0x1000U   // Execute-Only RAM D2
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM13   0x2000U   // Execute-Only RAM D3
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM14   0x4000U   // Execute-Only RAM D4
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM15   0x8000U   // Execute-Only RAM D5

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_DIAG register
//
//*************************************************************************************************
#define DCSM_Z1_DIAG_MPOST_EN_S   4U
#define DCSM_Z1_DIAG_MPOST_EN_M   0x30U   // MPOST Enable


//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_LINKPOINTER register
//
//*************************************************************************************************
#define DCSM_Z2_LINKPOINTER_LINKPOINTER_S   0U
#define DCSM_Z2_LINKPOINTER_LINKPOINTER_M   0x3FFFU   // Zone2 LINK Pointer

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_OTPSECLOCK register
//
//*************************************************************************************************
#define DCSM_Z2_OTPSECLOCK_JTAGLOCK     0x1U     // JTAG Lock Status
#define DCSM_Z2_OTPSECLOCK_PSWDLOCK_S   4U
#define DCSM_Z2_OTPSECLOCK_PSWDLOCK_M   0xF0U    // Zone2 Password Lock.
#define DCSM_Z2_OTPSECLOCK_CRCLOCK_S    8U
#define DCSM_Z2_OTPSECLOCK_CRCLOCK_M    0xF00U   // Zone2 CRC Lock.

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_LINKPOINTERERR register
//
//*************************************************************************************************
#define DCSM_Z2_LINKPOINTERERR_Z2_LINKPOINTERERR_S   0U
#define DCSM_Z2_LINKPOINTERERR_Z2_LINKPOINTERERR_M   0x3FFFU   // Error to Resolve Z2 Link pointer
                                                               // from OTP loaded values

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_CR register
//
//*************************************************************************************************
#define DCSM_Z2_CR_ALLZERO    0x80000U      // CSMPSWD All Zeros
#define DCSM_Z2_CR_ALLONE     0x100000U     // CSMPSWD All Ones
#define DCSM_Z2_CR_UNSECURE   0x200000U     // CSMPSWD Match CSMKEY
#define DCSM_Z2_CR_FORCESEC   0x80000000U   // Force Secure

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABSECT1R register
//
//*************************************************************************************************
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT0_S        0U
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT0_M        0x3U          // Grab Flash Bank0 Sector 0
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT1_S        2U
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT1_M        0xCU          // Grab Flash Bank0 Sector 1
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT2_S        4U
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT2_M        0x30U         // Grab Flash Bank0 Sector 2
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT3_S        6U
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT3_M        0xC0U         // Grab Flash Bank0 Sector 3
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT31_4_S     8U
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT31_4_M     0x300U        // Grab Flash Bank0 Sector 31-4
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT63_32_S    10U
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT63_32_M    0xC00U        // Grab Flash Bank0 Sector 63-32
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT95_64_S    12U
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT95_64_M    0x3000U       // Grab Flash Bank0 Sector 95-64
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT127_96_S   14U
#define DCSM_Z2_GRABSECT1R_GRAB_B0_SECT127_96_M   0xC000U       // Grab Flash Bank1 Sector 127-96
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT0_S        16U
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT0_M        0x30000U      // Grab Flash Bank1 Sector 0
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT1_S        18U
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT1_M        0xC0000U      // Grab Flash Bank1 Sector 1
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT2_S        20U
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT2_M        0x300000U     // Grab Flash Bank1 Sector 2
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT3_S        22U
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT3_M        0xC00000U     // Grab Flash Bank1 Sector 3
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT31_4_S     24U
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT31_4_M     0x3000000U    // Grab Flash Bank1 Sector 31-4
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT63_32_S    26U
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT63_32_M    0xC000000U    // Grab Flash Bank1 Sector 63-32
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT95_64_S    28U
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT95_64_M    0x30000000U   // Grab Flash Bank1 Sector 95-64
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT127_96_S   30U
#define DCSM_Z2_GRABSECT1R_GRAB_B1_SECT127_96_M   0xC0000000U   // Grab Flash Bank1 Sector 127-96

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABSECT2R register
//
//*************************************************************************************************
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT0_S        0U
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT0_M        0x3U          // Grab Flash Bank2 Sector 0
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT1_S        2U
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT1_M        0xCU          // Grab Flash Bank2 Sector 1
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT2_S        4U
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT2_M        0x30U         // Grab Flash Bank2 Sector 2
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT3_S        6U
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT3_M        0xC0U         // Grab Flash Bank2 Sector 3
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT31_4_S     8U
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT31_4_M     0x300U        // Grab Flash Bank2 Sector 31-4
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT63_32_S    10U
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT63_32_M    0xC00U        // Grab Flash Bank2 Sector 63-32
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT95_64_S    12U
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT95_64_M    0x3000U       // Grab Flash Bank2 Sector 95-64
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT127_96_S   14U
#define DCSM_Z2_GRABSECT2R_GRAB_B2_SECT127_96_M   0xC000U       // Grab Flash Bank2 Sector 127-96
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT0_S        16U
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT0_M        0x30000U      // Grab Flash Bank3 Sector 0
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT1_S        18U
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT1_M        0xC0000U      // Grab Flash Bank3 Sector 1
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT2_S        20U
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT2_M        0x300000U     // Grab Flash Bank3 Sector 2
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT3_S        22U
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT3_M        0xC00000U     // Grab Flash Bank3 Sector 3
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT31_4_S     24U
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT31_4_M     0x3000000U    // Grab Flash Bank3 Sector 31-4
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT63_32_S    26U
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT63_32_M    0xC000000U    // Grab Flash Bank3 Sector 63-32
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT95_64_S    28U
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT95_64_M    0x30000000U   // Grab Flash Bank3 Sector 95-64
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT127_96_S   30U
#define DCSM_Z2_GRABSECT2R_GRAB_B3_SECT127_96_M   0xC0000000U   // Grab Flash Bank3 Sector 127-96

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABSECT3R register
//
//*************************************************************************************************
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT0_S        0U
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT0_M        0x3U      // Grab Flash Bank4 Sector 0
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT1_S        2U
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT1_M        0xCU      // Grab Flash Bank4 Sector 1
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT2_S        4U
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT2_M        0x30U     // Grab Flash Bank4 Sector 2
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT3_S        6U
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT3_M        0xC0U     // Grab Flash Bank4 Sector 3
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT31_4_S     8U
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT31_4_M     0x300U    // Grab Flash Bank4 Sector 31-4
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT63_32_S    10U
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT63_32_M    0xC00U    // Grab Flash Bank4 Sector 63-32
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT95_64_S    12U
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT95_64_M    0x3000U   // Grab Flash Bank4 Sector 95-64
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT127_96_S   14U
#define DCSM_Z2_GRABSECT3R_GRAB_B4_SECT127_96_M   0xC000U   // Grab Flash Bank4 Sector 127-96

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABRAM1R register
//
//*************************************************************************************************
#define DCSM_Z2_GRABRAM1R_GRAB_RAM0_S    0U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM0_M    0x3U          // Grab RAM CPU1.LS0
#define DCSM_Z2_GRABRAM1R_GRAB_RAM1_S    2U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM1_M    0xCU          // Grab RAM CPU1.LS1
#define DCSM_Z2_GRABRAM1R_GRAB_RAM2_S    4U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM2_M    0x30U         // Grab RAM CPU1.LS2
#define DCSM_Z2_GRABRAM1R_GRAB_RAM3_S    6U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM3_M    0xC0U         // Grab RAM CPU1.LS3
#define DCSM_Z2_GRABRAM1R_GRAB_RAM4_S    8U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM4_M    0x300U        // Grab RAM CPU1.LS4
#define DCSM_Z2_GRABRAM1R_GRAB_RAM5_S    10U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM5_M    0xC00U        // Grab RAM CPU1.LS5
#define DCSM_Z2_GRABRAM1R_GRAB_RAM6_S    12U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM6_M    0x3000U       // Grab RAM CPU1.LS6
#define DCSM_Z2_GRABRAM1R_GRAB_RAM7_S    14U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM7_M    0xC000U       // Grab RAM CPU1.LS7
#define DCSM_Z2_GRABRAM1R_GRAB_RAM8_S    16U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM8_M    0x30000U      // Grab RAM CPU1.LS8
#define DCSM_Z2_GRABRAM1R_GRAB_RAM9_S    18U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM9_M    0xC0000U      // Grab RAM CPU1.LS9
#define DCSM_Z2_GRABRAM1R_GRAB_RAM10_S   20U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM10_M   0x300000U     // Grab RAM D0
#define DCSM_Z2_GRABRAM1R_GRAB_RAM11_S   22U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM11_M   0xC00000U     // Grab RAM D1
#define DCSM_Z2_GRABRAM1R_GRAB_RAM12_S   24U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM12_M   0x3000000U    // Grab RAM D2
#define DCSM_Z2_GRABRAM1R_GRAB_RAM13_S   26U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM13_M   0xC000000U    // Grab RAM D3
#define DCSM_Z2_GRABRAM1R_GRAB_RAM14_S   28U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM14_M   0x30000000U   // Grab RAM D4
#define DCSM_Z2_GRABRAM1R_GRAB_RAM15_S   30U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM15_M   0xC0000000U   // Grab RAM D5

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABRAM2R register
//
//*************************************************************************************************
#define DCSM_Z2_GRABRAM2R_GRAB_RAM12_S   0U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM12_M   0x3U    // Grab RAM CPU1TOCPU2 MSGRAM0_L
#define DCSM_Z2_GRABRAM2R_GRAB_RAM13_S   2U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM13_M   0xCU    // Grab RAM CPU1TOCPU2 MSGRAM0_H
#define DCSM_Z2_GRABRAM2R_GRAB_RAM14_S   4U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM14_M   0x30U   // Grab RAM CPU2TOCPU1 MSGRAM0_L
#define DCSM_Z2_GRABRAM2R_GRAB_RAM15_S   6U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM15_M   0xC0U   // Grab RAM CPU2TOCPU1 MSGRAM0_H

